-----------------------------------------------------------------------------------------------
             Layer (type)                                              Output Shape     Param #
===============================================================================================
                 Conv2d-1                                        [-1, 32, 208, 208]         864
            BatchNorm2d-2                                        [-1, 32, 208, 208]          64
                  ReLU6-3                                        [-1, 32, 208, 208]           0
                 Conv2d-4                                        [-1, 32, 208, 208]         288
            BatchNorm2d-5                                        [-1, 32, 208, 208]          64
                  ReLU6-6                                        [-1, 32, 208, 208]           0
                 Conv2d-7                                        [-1, 16, 208, 208]         512
            BatchNorm2d-8                                        [-1, 16, 208, 208]          32
       InvertedResidual-9                                        [-1, 16, 208, 208]           0
                Conv2d-10                                        [-1, 96, 208, 208]       1,536
           BatchNorm2d-11                                        [-1, 96, 208, 208]         192
                 ReLU6-12                                        [-1, 96, 208, 208]           0
                Conv2d-13                                        [-1, 96, 104, 104]         864
           BatchNorm2d-14                                        [-1, 96, 104, 104]         192
                 ReLU6-15                                        [-1, 96, 104, 104]           0
                Conv2d-16                                        [-1, 24, 104, 104]       2,304
           BatchNorm2d-17                                        [-1, 24, 104, 104]          48
      InvertedResidual-18                                        [-1, 24, 104, 104]           0
                Conv2d-19                                       [-1, 144, 104, 104]       3,456
           BatchNorm2d-20                                       [-1, 144, 104, 104]         288
                 ReLU6-21                                       [-1, 144, 104, 104]           0
                Conv2d-22                                       [-1, 144, 104, 104]       1,296
           BatchNorm2d-23                                       [-1, 144, 104, 104]         288
                 ReLU6-24                                       [-1, 144, 104, 104]           0
                Conv2d-25                                        [-1, 24, 104, 104]       3,456
           BatchNorm2d-26                                        [-1, 24, 104, 104]          48
      InvertedResidual-27                                        [-1, 24, 104, 104]           0
                Conv2d-28                                       [-1, 144, 104, 104]       3,456
           BatchNorm2d-29                                       [-1, 144, 104, 104]         288
                 ReLU6-30                                       [-1, 144, 104, 104]           0
                Conv2d-31                                         [-1, 144, 52, 52]       1,296
           BatchNorm2d-32                                         [-1, 144, 52, 52]         288
                 ReLU6-33                                         [-1, 144, 52, 52]           0
                Conv2d-34                                          [-1, 32, 52, 52]       4,608
           BatchNorm2d-35                                          [-1, 32, 52, 52]          64
      InvertedResidual-36                                          [-1, 32, 52, 52]           0
                Conv2d-37                                         [-1, 192, 52, 52]       6,144
           BatchNorm2d-38                                         [-1, 192, 52, 52]         384
                 ReLU6-39                                         [-1, 192, 52, 52]           0
                Conv2d-40                                         [-1, 192, 52, 52]       1,728
           BatchNorm2d-41                                         [-1, 192, 52, 52]         384
                 ReLU6-42                                         [-1, 192, 52, 52]           0
                Conv2d-43                                          [-1, 32, 52, 52]       6,144
           BatchNorm2d-44                                          [-1, 32, 52, 52]          64
      InvertedResidual-45                                          [-1, 32, 52, 52]           0
                Conv2d-46                                         [-1, 192, 52, 52]       6,144
           BatchNorm2d-47                                         [-1, 192, 52, 52]         384
                 ReLU6-48                                         [-1, 192, 52, 52]           0
                Conv2d-49                                         [-1, 192, 52, 52]       1,728
           BatchNorm2d-50                                         [-1, 192, 52, 52]         384
                 ReLU6-51                                         [-1, 192, 52, 52]           0
                Conv2d-52                                          [-1, 32, 52, 52]       6,144
           BatchNorm2d-53                                          [-1, 32, 52, 52]          64
      InvertedResidual-54                                          [-1, 32, 52, 52]           0
                Conv2d-55                                         [-1, 192, 52, 52]       6,144
           BatchNorm2d-56                                         [-1, 192, 52, 52]         384
                 ReLU6-57                                         [-1, 192, 52, 52]           0
                Conv2d-58                                         [-1, 192, 26, 26]       1,728
           BatchNorm2d-59                                         [-1, 192, 26, 26]         384
                 ReLU6-60                                         [-1, 192, 26, 26]           0
                Conv2d-61                                          [-1, 64, 26, 26]      12,288
           BatchNorm2d-62                                          [-1, 64, 26, 26]         128
      InvertedResidual-63                                          [-1, 64, 26, 26]           0
                Conv2d-64                                         [-1, 384, 26, 26]      24,576
           BatchNorm2d-65                                         [-1, 384, 26, 26]         768
                 ReLU6-66                                         [-1, 384, 26, 26]           0
                Conv2d-67                                         [-1, 384, 26, 26]       3,456
           BatchNorm2d-68                                         [-1, 384, 26, 26]         768
                 ReLU6-69                                         [-1, 384, 26, 26]           0
                Conv2d-70                                          [-1, 64, 26, 26]      24,576
           BatchNorm2d-71                                          [-1, 64, 26, 26]         128
      InvertedResidual-72                                          [-1, 64, 26, 26]           0
                Conv2d-73                                         [-1, 384, 26, 26]      24,576
           BatchNorm2d-74                                         [-1, 384, 26, 26]         768
                 ReLU6-75                                         [-1, 384, 26, 26]           0
                Conv2d-76                                         [-1, 384, 26, 26]       3,456
           BatchNorm2d-77                                         [-1, 384, 26, 26]         768
                 ReLU6-78                                         [-1, 384, 26, 26]           0
                Conv2d-79                                          [-1, 64, 26, 26]      24,576
           BatchNorm2d-80                                          [-1, 64, 26, 26]         128
      InvertedResidual-81                                          [-1, 64, 26, 26]           0
                Conv2d-82                                         [-1, 384, 26, 26]      24,576
           BatchNorm2d-83                                         [-1, 384, 26, 26]         768
                 ReLU6-84                                         [-1, 384, 26, 26]           0
                Conv2d-85                                         [-1, 384, 26, 26]       3,456
           BatchNorm2d-86                                         [-1, 384, 26, 26]         768
                 ReLU6-87                                         [-1, 384, 26, 26]           0
                Conv2d-88                                          [-1, 64, 26, 26]      24,576
           BatchNorm2d-89                                          [-1, 64, 26, 26]         128
      InvertedResidual-90                                          [-1, 64, 26, 26]           0
                Conv2d-91                                         [-1, 384, 26, 26]      24,576
           BatchNorm2d-92                                         [-1, 384, 26, 26]         768
                 ReLU6-93                                         [-1, 384, 26, 26]           0
                Conv2d-94                                         [-1, 384, 26, 26]       3,456
           BatchNorm2d-95                                         [-1, 384, 26, 26]         768
                 ReLU6-96                                         [-1, 384, 26, 26]           0
                Conv2d-97                                          [-1, 96, 26, 26]      36,864
           BatchNorm2d-98                                          [-1, 96, 26, 26]         192
      InvertedResidual-99                                          [-1, 96, 26, 26]           0
               Conv2d-100                                         [-1, 576, 26, 26]      55,296
          BatchNorm2d-101                                         [-1, 576, 26, 26]       1,152
                ReLU6-102                                         [-1, 576, 26, 26]           0
               Conv2d-103                                         [-1, 576, 26, 26]       5,184
          BatchNorm2d-104                                         [-1, 576, 26, 26]       1,152
                ReLU6-105                                         [-1, 576, 26, 26]           0
               Conv2d-106                                          [-1, 96, 26, 26]      55,296
          BatchNorm2d-107                                          [-1, 96, 26, 26]         192
     InvertedResidual-108                                          [-1, 96, 26, 26]           0
               Conv2d-109                                         [-1, 576, 26, 26]      55,296
          BatchNorm2d-110                                         [-1, 576, 26, 26]       1,152
                ReLU6-111                                         [-1, 576, 26, 26]           0
               Conv2d-112                                         [-1, 576, 26, 26]       5,184
          BatchNorm2d-113                                         [-1, 576, 26, 26]       1,152
                ReLU6-114                                         [-1, 576, 26, 26]           0
               Conv2d-115                                          [-1, 96, 26, 26]      55,296
          BatchNorm2d-116                                          [-1, 96, 26, 26]         192
     InvertedResidual-117                                          [-1, 96, 26, 26]           0
               Conv2d-118                                         [-1, 576, 26, 26]      55,296
          BatchNorm2d-119                                         [-1, 576, 26, 26]       1,152
                ReLU6-120                                         [-1, 576, 26, 26]           0
               Conv2d-121                                         [-1, 576, 13, 13]       5,184
          BatchNorm2d-122                                         [-1, 576, 13, 13]       1,152
                ReLU6-123                                         [-1, 576, 13, 13]           0
               Conv2d-124                                         [-1, 160, 13, 13]      92,160
          BatchNorm2d-125                                         [-1, 160, 13, 13]         320
     InvertedResidual-126                                         [-1, 160, 13, 13]           0
               Conv2d-127                                         [-1, 960, 13, 13]     153,600
          BatchNorm2d-128                                         [-1, 960, 13, 13]       1,920
                ReLU6-129                                         [-1, 960, 13, 13]           0
               Conv2d-130                                         [-1, 960, 13, 13]       8,640
          BatchNorm2d-131                                         [-1, 960, 13, 13]       1,920
                ReLU6-132                                         [-1, 960, 13, 13]           0
               Conv2d-133                                         [-1, 160, 13, 13]     153,600
          BatchNorm2d-134                                         [-1, 160, 13, 13]         320
     InvertedResidual-135                                         [-1, 160, 13, 13]           0
               Conv2d-136                                         [-1, 960, 13, 13]     153,600
          BatchNorm2d-137                                         [-1, 960, 13, 13]       1,920
                ReLU6-138                                         [-1, 960, 13, 13]           0
               Conv2d-139                                         [-1, 960, 13, 13]       8,640
          BatchNorm2d-140                                         [-1, 960, 13, 13]       1,920
                ReLU6-141                                         [-1, 960, 13, 13]           0
               Conv2d-142                                         [-1, 160, 13, 13]     153,600
          BatchNorm2d-143                                         [-1, 160, 13, 13]         320
     InvertedResidual-144                                         [-1, 160, 13, 13]           0
               Conv2d-145                                         [-1, 960, 13, 13]     153,600
          BatchNorm2d-146                                         [-1, 960, 13, 13]       1,920
                ReLU6-147                                         [-1, 960, 13, 13]           0
               Conv2d-148                                         [-1, 960, 13, 13]       8,640
          BatchNorm2d-149                                         [-1, 960, 13, 13]       1,920
                ReLU6-150                                         [-1, 960, 13, 13]           0
               Conv2d-151                                         [-1, 320, 13, 13]     307,200
          BatchNorm2d-152                                         [-1, 320, 13, 13]         640
     InvertedResidual-153                                         [-1, 320, 13, 13]           0
             Backbone-154   [[-1, 32, 52, 52], [-1, 96, 26, 26], [-1, 320, 13, 13]]           0
               Conv2d-155                                         [-1, 512, 13, 13]     163,840
          BatchNorm2d-156                                         [-1, 512, 13, 13]       1,024
                ReLU6-157                                         [-1, 512, 13, 13]           0
               Conv2d-158                                         [-1, 512, 13, 13]       4,608
          BatchNorm2d-159                                         [-1, 512, 13, 13]       1,024
                ReLU6-160                                         [-1, 512, 13, 13]           0
               Conv2d-161                                        [-1, 1024, 13, 13]     524,288
          BatchNorm2d-162                                        [-1, 1024, 13, 13]       2,048
                ReLU6-163                                        [-1, 1024, 13, 13]           0
               Conv2d-164                                         [-1, 512, 13, 13]     524,288
          BatchNorm2d-165                                         [-1, 512, 13, 13]       1,024
                ReLU6-166                                         [-1, 512, 13, 13]           0
            MaxPool2d-167                                         [-1, 512, 13, 13]           0
            MaxPool2d-168                                         [-1, 512, 13, 13]           0
            MaxPool2d-169                                         [-1, 512, 13, 13]           0
SpatialPyramidPooling-170                                        [-1, 2048, 13, 13]           0
               Conv2d-171                                         [-1, 512, 13, 13]   1,048,576
          BatchNorm2d-172                                         [-1, 512, 13, 13]       1,024
                ReLU6-173                                         [-1, 512, 13, 13]           0
               Conv2d-174                                         [-1, 512, 13, 13]       4,608
          BatchNorm2d-175                                         [-1, 512, 13, 13]       1,024
                ReLU6-176                                         [-1, 512, 13, 13]           0
               Conv2d-177                                        [-1, 1024, 13, 13]     524,288
          BatchNorm2d-178                                        [-1, 1024, 13, 13]       2,048
                ReLU6-179                                        [-1, 1024, 13, 13]           0
               Conv2d-180                                         [-1, 512, 13, 13]     524,288
          BatchNorm2d-181                                         [-1, 512, 13, 13]       1,024
                ReLU6-182                                         [-1, 512, 13, 13]           0
               Conv2d-183                                         [-1, 256, 13, 13]     131,072
          BatchNorm2d-184                                         [-1, 256, 13, 13]         512
                ReLU6-185                                         [-1, 256, 13, 13]           0
             Upsample-186                                         [-1, 256, 26, 26]           0
             Upsample-187                                         [-1, 256, 26, 26]           0
               Conv2d-188                                         [-1, 256, 26, 26]      24,576
          BatchNorm2d-189                                         [-1, 256, 26, 26]         512
                ReLU6-190                                         [-1, 256, 26, 26]           0
               Conv2d-191                                         [-1, 256, 26, 26]     131,072
          BatchNorm2d-192                                         [-1, 256, 26, 26]         512
                ReLU6-193                                         [-1, 256, 26, 26]           0
               Conv2d-194                                         [-1, 256, 26, 26]       2,304
          BatchNorm2d-195                                         [-1, 256, 26, 26]         512
                ReLU6-196                                         [-1, 256, 26, 26]           0
               Conv2d-197                                         [-1, 512, 26, 26]     131,072
          BatchNorm2d-198                                         [-1, 512, 26, 26]       1,024
                ReLU6-199                                         [-1, 512, 26, 26]           0
               Conv2d-200                                         [-1, 256, 26, 26]     131,072
          BatchNorm2d-201                                         [-1, 256, 26, 26]         512
                ReLU6-202                                         [-1, 256, 26, 26]           0
               Conv2d-203                                         [-1, 256, 26, 26]       2,304
          BatchNorm2d-204                                         [-1, 256, 26, 26]         512
                ReLU6-205                                         [-1, 256, 26, 26]           0
               Conv2d-206                                         [-1, 512, 26, 26]     131,072
          BatchNorm2d-207                                         [-1, 512, 26, 26]       1,024
                ReLU6-208                                         [-1, 512, 26, 26]           0
               Conv2d-209                                         [-1, 256, 26, 26]     131,072
          BatchNorm2d-210                                         [-1, 256, 26, 26]         512
                ReLU6-211                                         [-1, 256, 26, 26]           0
               Conv2d-212                                         [-1, 128, 26, 26]      32,768
          BatchNorm2d-213                                         [-1, 128, 26, 26]         256
                ReLU6-214                                         [-1, 128, 26, 26]           0
             Upsample-215                                         [-1, 128, 52, 52]           0
             Upsample-216                                         [-1, 128, 52, 52]           0
               Conv2d-217                                         [-1, 128, 52, 52]       4,096
          BatchNorm2d-218                                         [-1, 128, 52, 52]         256
                ReLU6-219                                         [-1, 128, 52, 52]           0
               Conv2d-220                                         [-1, 128, 52, 52]      32,768
          BatchNorm2d-221                                         [-1, 128, 52, 52]         256
                ReLU6-222                                         [-1, 128, 52, 52]           0
               Conv2d-223                                         [-1, 128, 52, 52]       1,152
          BatchNorm2d-224                                         [-1, 128, 52, 52]         256
                ReLU6-225                                         [-1, 128, 52, 52]           0
               Conv2d-226                                         [-1, 256, 52, 52]      32,768
          BatchNorm2d-227                                         [-1, 256, 52, 52]         512
                ReLU6-228                                         [-1, 256, 52, 52]           0
               Conv2d-229                                         [-1, 128, 52, 52]      32,768
          BatchNorm2d-230                                         [-1, 128, 52, 52]         256
                ReLU6-231                                         [-1, 128, 52, 52]           0
               Conv2d-232                                         [-1, 128, 52, 52]       1,152
          BatchNorm2d-233                                         [-1, 128, 52, 52]         256
                ReLU6-234                                         [-1, 128, 52, 52]           0
               Conv2d-235                                         [-1, 256, 52, 52]      32,768
          BatchNorm2d-236                                         [-1, 256, 52, 52]         512
                ReLU6-237                                         [-1, 256, 52, 52]           0
               Conv2d-238                                         [-1, 128, 52, 52]      32,768
          BatchNorm2d-239                                         [-1, 128, 52, 52]         256
                ReLU6-240                                         [-1, 128, 52, 52]           0
               Conv2d-241                                         [-1, 128, 26, 26]       1,152
          BatchNorm2d-242                                         [-1, 128, 26, 26]         256
                ReLU6-243                                         [-1, 128, 26, 26]           0
               Conv2d-244                                         [-1, 256, 26, 26]      32,768
          BatchNorm2d-245                                         [-1, 256, 26, 26]         512
                ReLU6-246                                         [-1, 256, 26, 26]           0
               Conv2d-247                                         [-1, 256, 26, 26]     131,072
          BatchNorm2d-248                                         [-1, 256, 26, 26]         512
                ReLU6-249                                         [-1, 256, 26, 26]           0
               Conv2d-250                                         [-1, 256, 26, 26]       2,304
          BatchNorm2d-251                                         [-1, 256, 26, 26]         512
                ReLU6-252                                         [-1, 256, 26, 26]           0
               Conv2d-253                                         [-1, 512, 26, 26]     131,072
          BatchNorm2d-254                                         [-1, 512, 26, 26]       1,024
                ReLU6-255                                         [-1, 512, 26, 26]           0
               Conv2d-256                                         [-1, 256, 26, 26]     131,072
          BatchNorm2d-257                                         [-1, 256, 26, 26]         512
                ReLU6-258                                         [-1, 256, 26, 26]           0
               Conv2d-259                                         [-1, 256, 26, 26]       2,304
          BatchNorm2d-260                                         [-1, 256, 26, 26]         512
                ReLU6-261                                         [-1, 256, 26, 26]           0
               Conv2d-262                                         [-1, 512, 26, 26]     131,072
          BatchNorm2d-263                                         [-1, 512, 26, 26]       1,024
                ReLU6-264                                         [-1, 512, 26, 26]           0
               Conv2d-265                                         [-1, 256, 26, 26]     131,072
          BatchNorm2d-266                                         [-1, 256, 26, 26]         512
                ReLU6-267                                         [-1, 256, 26, 26]           0
               Conv2d-268                                         [-1, 256, 13, 13]       2,304
          BatchNorm2d-269                                         [-1, 256, 13, 13]         512
                ReLU6-270                                         [-1, 256, 13, 13]           0
               Conv2d-271                                         [-1, 512, 13, 13]     131,072
          BatchNorm2d-272                                         [-1, 512, 13, 13]       1,024
                ReLU6-273                                         [-1, 512, 13, 13]           0
               Conv2d-274                                         [-1, 512, 13, 13]     524,288
          BatchNorm2d-275                                         [-1, 512, 13, 13]       1,024
                ReLU6-276                                         [-1, 512, 13, 13]           0
               Conv2d-277                                         [-1, 512, 13, 13]       4,608
          BatchNorm2d-278                                         [-1, 512, 13, 13]       1,024
                ReLU6-279                                         [-1, 512, 13, 13]           0
               Conv2d-280                                        [-1, 1024, 13, 13]     524,288
          BatchNorm2d-281                                        [-1, 1024, 13, 13]       2,048
                ReLU6-282                                        [-1, 1024, 13, 13]           0
               Conv2d-283                                         [-1, 512, 13, 13]     524,288
          BatchNorm2d-284                                         [-1, 512, 13, 13]       1,024
                ReLU6-285                                         [-1, 512, 13, 13]           0
               Conv2d-286                                         [-1, 512, 13, 13]       4,608
          BatchNorm2d-287                                         [-1, 512, 13, 13]       1,024
                ReLU6-288                                         [-1, 512, 13, 13]           0
               Conv2d-289                                        [-1, 1024, 13, 13]     524,288
          BatchNorm2d-290                                        [-1, 1024, 13, 13]       2,048
                ReLU6-291                                        [-1, 1024, 13, 13]           0
               Conv2d-292                                         [-1, 512, 13, 13]     524,288
          BatchNorm2d-293                                         [-1, 512, 13, 13]       1,024
                ReLU6-294                                         [-1, 512, 13, 13]           0
               Conv2d-295                                         [-1, 128, 52, 52]       1,152
          BatchNorm2d-296                                         [-1, 128, 52, 52]         256
                ReLU6-297                                         [-1, 128, 52, 52]           0
               Conv2d-298                                         [-1, 256, 52, 52]      32,768
          BatchNorm2d-299                                         [-1, 256, 52, 52]         512
                ReLU6-300                                         [-1, 256, 52, 52]           0
               Conv2d-301                                         [-1, 255, 52, 52]      65,535
               Conv2d-302                                         [-1, 256, 26, 26]       2,304
          BatchNorm2d-303                                         [-1, 256, 26, 26]         512
                ReLU6-304                                         [-1, 256, 26, 26]           0
               Conv2d-305                                         [-1, 512, 26, 26]     131,072
          BatchNorm2d-306                                         [-1, 512, 26, 26]       1,024
                ReLU6-307                                         [-1, 512, 26, 26]           0
               Conv2d-308                                         [-1, 255, 26, 26]     130,815
               Conv2d-309                                         [-1, 512, 13, 13]       4,608
          BatchNorm2d-310                                         [-1, 512, 13, 13]       1,024
                ReLU6-311                                         [-1, 512, 13, 13]           0
               Conv2d-312                                        [-1, 1024, 13, 13]     524,288
          BatchNorm2d-313                                        [-1, 1024, 13, 13]       2,048
                ReLU6-314                                        [-1, 1024, 13, 13]           0
               Conv2d-315                                         [-1, 255, 13, 13]     261,375
===============================================================================================
Total params: 10,801,149
Trainable params: 10,801,149
Non-trainable params: 0
-----------------------------------------------------------------------------------------------
Input size (MB): 1.98
Forward/backward pass size (MB): 2316869107.25
Params size (MB): 41.20
Estimated Total Size (MB): 2316869150.43
-----------------------------------------------------------------------------------------------
Total flops: 8.286G
Total params: 10.801M
-----------------------------------------------------------------------------------------------